#include "mbed.h"
#include "math.h"

#define VCC     3.30f       //印加電圧
#define OFFSET  VCC / 2     //オフセット電圧
#define VPG     0.66f       //660mV/g

#define SG      9.80665f    //標準重力加速度

float PGA_data[11] = {0, 0.6, 2, 6, 20, 60, 110, 200, 350, 600, 1000/*dontcare*/};

//***** 震度 *****//  1gal = 0.01m/s^2, 1G = 980gal
//震度０(0)：0-0.6 [gal]
//震度１(1)：0.6-2 [gal]
//震度２(2)：2-6 [gal]
//震度３(3)：6-20 [gal]         //ライト点灯
//震度４(4)：20-60 [gal]
//震度５弱(5)：60-110 [gal]     //IHオフ and 給湯ストップ
//震度５強(6)：110-200 [gal]

//震度６弱(7)：200-350 [gal]    //2G以上は印加しない
//震度６強(8)：350-600 [gal]
//震度７(9)：over 600 [gal]

